Stagnator/SK120X_ESP8266_Web_control/src/main.cpp
#include <Arduino.h>
#include <ModbusMaster.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>

// ===== WiFi
// #include <JustMyWifiSet.h>
// const char *WIFI_SSID = MY_WIFI_SSID;
// const char *WIFI_PASS = MY_WIFI_PASS;
// const char *OTA_IP_ADDR = MY_OTA_IP_ADDR;
const char *WIFI_SSID = "YOUR_WIFI_SSID";
const char *WIFI_PASS = "YOUR_WIFI_PASSWORD";

const char *AP_HOSTNAME = "Lab_bench_PSU AP";
const char *ST_HOSTNAME = "Lab_bench_PSU STA";
#define DHCP_ENABLED false // Set to true to use DHCP, false for static IP
IPAddress local_IP(192, 168, 1, 36);
IPAddress gateway(192, 168, 1, 1);
IPAddress subnet(255, 255, 255, 0);
const char *OTA_PASSWORD = "admin";

// ===== UART / RS485 we dont need Serial2, using Serial with swap
/*#define UART_RX 13
#define UART_TX 15
#define UART_BAUD 115200 */
#define RS485_DE_RE_PIN 16
#define USE_RS485_DIR false

#define PIN_PWM_FUN 12  // Control of external cooling fan
#define MAX_POWER 10000 // Max Power for cooler speed regulation 1:100 W
#define MIN_POWER 5000  // Min Power for cooler speed regulation 1:100 W

// ===== Modbus
#define MODBUS_SLAVE_ID 1

// Known regs (stable)
#define REG_SET_VOLT 0x0000   // V*100
#define REG_SET_CURR 0x0001   // A*1000
#define REG_OUT_VOLT 0x0002   // V*100
#define REG_OUT_CURR 0x0003   // A*1000
#define REG_OUT_POWER 0x0004  // W*100
#define REG_OUT_ENABLE 0x0012 // 0/1

// Community/experimental (may differ by FW)
#define REG_MPPT_ENABLE 0x001F // 0/1 (medium confidence)

ModbusMaster node;
ESP8266WebServer server(80);

// ---------- HTML ----------
const char INDEX_HTML[] PROGMEM = R"HTML(<!doctype html>
<html>
<head>
  <meta charset="utf-8"/>
  <meta name="viewport" content="width=device-width,initial-scale=1"/>
  <title>SK120x Controller</title>
  <style>
    body{margin:20px;font-family:Segoe UI,Arial,sans-serif;background:#f0f0f0}
    h1{margin:.2rem 0;text-align:center}

    /* Panels mimic LabVIEW groups */
    .panel{background:#fff;border:2px solid #999;border-radius:6px;padding:12px;margin:10px;box-shadow:2px 2px 5px rgba(0,0,0,.2)}
    .title{font-weight:bold;background:#ddd;padding:4px 6px;margin:-12px -12px 8px -12px;border-bottom:2px solid #999}
    .row{display:flex;flex-wrap:wrap;gap:16px;justify-content:space-around}

    /* 7-seg style readouts (local only) */
    .seven{font-family:monospace;font-size:2.2em;color:#0c0;background:#000;padding:4px 8px;border-radius:4px;display:inline-block;min-width:110px;text-align:right;letter-spacing:1px}
    .seven.red{color:#f33}

    /* Gauges (simple circular face) */
    .gWrap{display:flex;flex-direction:column;align-items:center;gap:6px}
    .gauge{width:120px;height:120px;border-radius:50%;border:8px solid #666;position:relative;background:#222;color:#fff;display:flex;align-items:center;justify-content:center}
    .gauge span{font-weight:bold;font-size:1.4em}

    /* Buttons / inputs */
    .controls button, .btn{padding:8px 14px;margin:4px;border-radius:6px;cursor:pointer;border:1px solid #bbb;background:#eee}
    .controls button:hover, .btn:hover{background:#e2e2e2}
    input[type=number], input[type=text]{padding:8px;border-radius:6px;border:1px solid #bbb;min-width:130px}

    /* Charts */
    canvas{background:#111;border:1px solid #666;border-radius:4px}

    /* Scanner table */
    .tableWrap{max-height:350px;overflow:auto;border:1px solid #ccc;border-radius:6px}
    table{border-collapse:collapse;width:100%;background:#fff}
    th,td{border-bottom:1px solid #eee;padding:6px 8px;text-align:left;font-size:.95em}
    thead th{position:sticky;top:0;background:#ddd;border-bottom:2px solid #bbb;z-index:1}
    tbody tr:nth-child(even){background:#fafafa}
    .small{font-size:.9em;color:#666}
    .status{margin-left:10px}
    .ok{color:#0a0}.err{color:#a00}
  </style>
</head>
<body>
<h1>SK120x Web Controller</h1>

<!-- Top row: status + setpoints -->
<div class="row">
  <div class="panel" style="flex:1">
    <div class="title">Current Status</div>
    <div class="row">
      <div><b>Set Voltage</b><div id="setV" class="seven">--.--</div></div>
      <div><b>Set Current</b><div id="setA" class="seven">--.---</div></div>
      <div><b>Out Voltage</b><div id="outV" class="seven">--.--</div></div>
      <div><b>Out Current</b><div id="outA" class="seven">--.---</div></div>
      <div><b>Out Power</b><div id="outP" class="seven">--.--</div></div>
    </div>
    <div style="margin-top:10px">
      <span><b>Output:</b> <span id="outState">-</span></span> |
      <span><b>MPPT:</b> <span id="mppt">?</span></span>
    </div>
    <div class="controls">
      <button id="toggleBtn" class="btn">Toggle Output</button>
      <button id="refreshBtn" class="btn">Refresh</button>
      <span id="status" class="status"></span>
    </div>
  </div>

  <div class="panel" style="flex:1">
    <div class="title">Setpoints</div>
    <div class="row">
      <div class="gWrap">
        <div class="gauge"><span id="gaugeV">--</span>&nbsp;V</div>
        <div>
          <input type="number" id="newV" step="0.01" min="0" value="12.00"/>
          <button id="applyV" class="btn">Apply V</button>
        </div>
      </div>
      <div class="gWrap">
        <div class="gauge"><span id="gaugeA">--</span>&nbsp;A</div>
        <div>
          <input type="number" id="newA" step="0.001" min="0" value="1.000"/>
          <button id="applyA" class="btn">Apply A</button>
        </div>
      </div>
      <div class="gWrap">
        <div class="gauge"><span id="gaugeMPPT">MPPT</span></div>
        <div>
          <input type="number" id="mpptVal" step="1" min="0" max="1" value="0"/>
          <button id="applyMPPT" class="btn">Set MPPT</button>
        </div>
      </div>
    </div>
  </div>
</div>

<!-- Middle row: history + histogram -->
<div class="row">
  <div class="panel" style="flex:1">
    <div class="title">Temperature/Voltage History (style)</div>
    <canvas id="chartHistory" height="200"></canvas>
  </div>
  <div class="panel" style="flex:1">
    <div class="title">Histogram</div>
    <canvas id="chartHist" height="200"></canvas>
  </div>
</div>

<!-- Bottom row: REGISTER SCANNER -->
<div class="panel">
  <div class="title">Register Scanner</div>
  <div class="row" style="align-items:end">
    <div>
      <label>Start (hex or dec)</label><br/>
      <input type="text" id="scanStart" value="0x0000"/>
    </div>
    <div>
      <label>End (hex or dec)</label><br/>
      <input type="text" id="scanEnd" value="0x0080"/>
    </div>
    <div>
      <button id="doScan" class="btn">Scan</button>
      <button id="exportCSV" class="btn">Export CSV</button>
    </div>
    <div class="small" style="flex:1">
      Shows raw and known interpretations. Use small ranges for fast results.
    </div>
  </div>

