Stagnator/SK120X_ESP8266_Web_control/src/main.cpp
  <div class="tableWrap" style="margin-top:10px">
    <table id="scanTable">
      <thead>
        <tr>
          <th>Address (hex)</th>
          <th>Address (dec)</th>
          <th>Raw (dec)</th>
          <th>Known</th>
          <th>Interpreted</th>
        </tr>
      </thead>
      <tbody></tbody>
    </table>
  </div>
</div>

<script>
/* -------- Helpers / UI -------- */
function setText(id,val,dp,alertLimit){
  const el=document.getElementById(id);
  if(val==null||isNaN(val)){ el.textContent='--'; el.classList.remove('red'); return; }
  el.textContent=Number(val).toFixed(dp);
  if(alertLimit && val>alertLimit) el.classList.add('red'); else el.classList.remove('red');
}
function showStatus(msg,ok=true){
  const el=document.getElementById('status');
  el.textContent=msg; el.className='status ' + (ok?'ok':'err');
  setTimeout(()=>{el.textContent=''; el.className='status';},1500);
}

/* -------- Minimal local charting (no CDN) -------- */
class LineChart {
  constructor(canvas, opts){
    this.c = canvas; this.ctx = canvas.getContext('2d');
    this.volts=[]; this.amps=[];
    this.maxPoints = (opts && opts.maxPoints) || 50;
  }
  add(v,a){
    this.volts.push(v); this.amps.push(a);
    if(this.volts.length>this.maxPoints){ this.volts.shift(); this.amps.shift(); }
  }
  draw(){
    const ctx=this.ctx, w=this.c.width, h=this.c.height;
    const DPR = window.devicePixelRatio||1;
    if(this.c.style.width===''){ this.c.style.width = w+'px'; }
    // scale canvas for HiDPI
    if(this.c.width !== this.c.clientWidth*DPR){ this.c.width=this.c.clientWidth*DPR; this.c.height=this.c.clientHeight*DPR; }
    const padL=35, padR=10, padT=10, padB=18;
    const W=this.c.width, H=this.c.height;
    ctx.fillStyle='#111'; ctx.fillRect(0,0,W,H);
    // axes
    ctx.strokeStyle='#555'; ctx.lineWidth=1;
    ctx.beginPath(); ctx.moveTo(padL, padT); ctx.lineTo(padL, H-padB); ctx.lineTo(W-padR, H-padB); ctx.stroke();

    const n=this.volts.length;
    if(!n) return;

    const vMin=Math.min(...this.volts), vMax=Math.max(...this.volts);
    const aMin=Math.min(...this.amps),  aMax=Math.max(...this.amps);
    const yMin=Math.min(vMin, aMin), yMax=Math.max(vMax, aMax);
    const range = (yMax-yMin)||1;

    // grid
    ctx.strokeStyle='#333';
    for(let i=0;i<=4;i++){
      const y = padT + (H-padT-padB)*i/4;
      ctx.beginPath(); ctx.moveTo(padL,y); ctx.lineTo(W-padR,y); ctx.stroke();
    }

    const x0=padL, x1=W-padR, y0=H-padB, y1=padT;
    const toXY = (idx,val) => {
      const x = x0 + (x1-x0) * (idx/(Math.max(1,n-1)));
      const y = y0 - (y0-y1) * ((val - yMin)/range);
      return [x,y];
    };

    // volts line (yellow)
    ctx.lineWidth=2; ctx.strokeStyle='yellow'; ctx.beginPath();
    for(let i=0;i<n;i++){ const [x,y]=toXY(i,this.volts[i]); if(i) ctx.lineTo(x,y); else ctx.moveTo(x,y); }
    ctx.stroke();

    // amps line (cyan)
    ctx.lineWidth=2; ctx.strokeStyle='cyan'; ctx.beginPath();
    for(let i=0;i<n;i++){ const [x,y]=toXY(i,this.amps[i]); if(i) ctx.lineTo(x,y); else ctx.moveTo(x,y); }
    ctx.stroke();

    // legend
    ctx.fillStyle='#ddd'; ctx.font = `${12*(window.devicePixelRatio||1)}px sans-serif`;
    ctx.fillText('Voltage', padL+6, padT+14);
    ctx.fillText('Current', padL+80, padT+14);
  }
}

class BarChart {
  constructor(canvas){
    this.c=canvas; this.ctx=canvas.getContext('2d');
    this.bins = new Map(); // key -> count
  }
  addVoltage(v){
    const k = Math.round(v);
    this.bins.set(k, (this.bins.get(k)||0)+1);
  }
  draw(){
    const ctx=this.ctx, DPR=window.devicePixelRatio||1;
    if(this.c.width !== this.c.clientWidth*DPR){ this.c.width=this.c.clientWidth*DPR; this.c.height=this.c.clientHeight*DPR; }
    const W=this.c.width, H=this.c.height, padL=35, padR=10, padT=10, padB=20;
    ctx.fillStyle='#111'; ctx.fillRect(0,0,W,H);
    ctx.strokeStyle='#555'; ctx.lineWidth=1;
    ctx.beginPath(); ctx.moveTo(padL,padT); ctx.lineTo(padL,H-padB); ctx.lineTo(W-padR,H-padB); ctx.stroke();
    const keys=[...this.bins.keys()].sort((a,b)=>a-b);
    if(!keys.length) return;
    const maxCount = Math.max(...keys.map(k=>this.bins.get(k)));
    const bw = (W-padL-padR)/keys.length;
    keys.forEach((k,i)=>{
      const count=this.bins.get(k);
      const x = padL + i*bw + 2;
      const h = (H-padT-padB) * (count/maxCount);
      const y = (H-padB) - h;
      ctx.fillStyle='lime';
      ctx.fillRect(x, y, Math.max(1,bw-4), h);
      // x labels sparse
      if(i%Math.ceil(keys.length/8)===0){
        ctx.fillStyle='#ddd'; ctx.font = `${10*DPR}px sans-serif`;
        ctx.fillText(String(k), x, H-6);
      }
    });
    // y label
    ctx.fillStyle='#ddd'; ctx.font = `${12*DPR}px sans-serif`;
    ctx.fillText('Voltage bins', padL+6, padT+14);
  }
}

/* -------- Status fetch -------- */
async function getStatus(){
  try{
    const r = await fetch('/api/status'); const j = await r.json(); if(!j.ok) throw new Error();
    setText('setV',j.setV,2); setText('setA',j.setA,3);
    setText('outV',j.outV,2,35); setText('outA',j.outA,3);
    setText('outP',j.outP,2);

    document.getElementById('gaugeV').textContent = isFinite(j.setV) ? j.setV.toFixed(1) : '--';
    document.getElementById('gaugeA').textContent = isFinite(j.setA) ? j.setA.toFixed(2) : '--';
    document.getElementById('gaugeMPPT').textContent = (j.mppt===null)?'MPPT':'MPPT ' + (j.mppt?'ON':'OFF');

    document.getElementById('outState').textContent = j.outputOn?'ON':'OFF';
    document.getElementById('mppt').textContent = (j.mppt===null)?'n/a':(j.mppt?'ON':'OFF');

    addHistory(j.outV,j.outA);
  }catch(e){}
}
async function writeReg(reg,val){ const r=await fetch(`/api/write?reg=${reg}&val=${val}`,{method:'POST'}); return r.json(); }
async function setVoltage(v){ return writeReg(0, Math.round(v*100)); }
async function setCurrent(a){ return writeReg(1, Math.round(a*1000)); }
async function setOutput(on){ return writeReg(0x12, on?1:0); }
async function setMPPT(on){ return writeReg(0x1F, on?1:0); }

document.getElementById('refreshBtn').onclick=()=>getStatus();
document.getElementById('toggleBtn').onclick=async()=>{
  const state = document.getElementById('outState').textContent.trim()==='ON';
  const r = await setOutput(!state); showStatus(r.ok?'Output toggled':(r.msg||'Error'), r.ok); getStatus();
};
document.getElementById('applyV').onclick=async()=>{
  const v=parseFloat(document.getElementById('newV').value); if(isNaN(v)) return showStatus('Bad voltage',false);
  const r=await setVoltage(v); showStatus(r.ok?'Voltage set':(r.msg||'Error'), r.ok); getStatus();
};
