Stagnator/SK120X_ESP8266_Web_control/src/main.cpp
document.getElementById('applyA').onclick=async()=>{
  const a=parseFloat(document.getElementById('newA').value); if(isNaN(a)) return showStatus('Bad current',false);
  const r=await setCurrent(a); showStatus(r.ok?'Current set':(r.msg||'Error'), r.ok); getStatus();
};
document.getElementById('applyMPPT').onclick=async()=>{
  const v=parseInt(document.getElementById('mpptVal').value); if(isNaN(v)||v<0||v>1) return showStatus('MPPT must be 0 or 1',false);
  const r=await setMPPT(v===1); showStatus(r.ok?'MPPT set':(r.msg||'Error'), r.ok); getStatus();
};

/* -------- Charts: local renderers -------- */
const histCanvas=document.getElementById('chartHistory');
const barCanvas=document.getElementById('chartHist');
const historyChart = new LineChart(histCanvas,{maxPoints:50});
const voltHist = new BarChart(barCanvas);

function addHistory(v,a){
  if(!isFinite(v)||!isFinite(a)) return;
  historyChart.add(v,a);
  historyChart.draw();
  voltHist.addVoltage(v);
  voltHist.draw();
}

/* -------- Register Scanner -------- */
function toHex(n){return '0x'+('0000'+n.toString(16)).slice(-4).toUpperCase();}
function parseAddr(s){
  s=s.trim();
  if(s.startsWith('0x')||s.startsWith('0X')) return parseInt(s,16);
  return parseInt(s,10);
}
async function doScan(){
  const s=parseAddr(document.getElementById('scanStart').value);
  const e=parseAddr(document.getElementById('scanEnd').value);
  if(!Number.isInteger(s)||!Number.isInteger(e)||e<s){ showStatus('Bad range',false); return; }
  const r=await fetch(`/api/scan?start=${encodeURIComponent(document.getElementById('scanStart').value)}&end=${encodeURIComponent(document.getElementById('scanEnd').value)}`);
  const j=await r.json();
  if(!j.ok){ showStatus(j.msg||'Scan error',false); return; }

  const tbody=document.querySelector('#scanTable tbody');
  tbody.innerHTML='';
  j.rows.forEach(x=>{
    const tr=document.createElement('tr');
    tr.innerHTML = `
      <td>${toHex(x.addr)}</td>
      <td>${x.addr}</td>
      <td>${x.dec}</td>
      <td>${x.meaning||''}</td>
      <td>${x.interpretation||''}</td>`;
    tbody.appendChild(tr);
  });
}
document.getElementById('doScan').onclick=doScan;

/* Export CSV for scanner */
document.getElementById('exportCSV').onclick=()=>{
  const rows=[['addr_hex','addr_dec','raw_dec','known','interpreted']];
  document.querySelectorAll('#scanTable tbody tr').forEach(tr=>{
    const cols=[...tr.children].map(td=>td.textContent.replaceAll(',', ''));
    rows.push(cols);
  });
  const csv=rows.map(r=>r.join(',')).join('\n');
  const blob=new Blob([csv],{type:'text/csv'});
  const a=document.createElement('a');
  a.href=URL.createObjectURL(blob);
  a.download='sk120x_scan.csv';
  a.click();
  URL.revokeObjectURL(a.href);
};

/* -------- Kickoff -------- */
setInterval(getStatus,1000);
getStatus();
</script>
</body>
</html>
)HTML";

// ---------- RS485 Direction ----------
void preTransmission()
{
#if USE_RS485_DIR
  digitalWrite(RS485_DE_RE_PIN, HIGH);
  delayMicroseconds(10);
#endif
}
void postTransmission()
{
#ifdef USE_RS485_DIR
  delayMicroseconds(10);
  digitalWrite(RS485_DE_RE_PIN, LOW);
#endif
}

// ---------- Helpers ----------
bool mbReadU16(uint16_t reg, uint16_t &out)
{
  uint8_t rc = node.readHoldingRegisters(reg, 1);
  if (rc == node.ku8MBSuccess)
  {
    out = node.getResponseBuffer(0);
    node.clearResponseBuffer();
    return true;
  }
  return false;
}
bool mbWriteU16(uint16_t reg, uint16_t val)
{
  uint8_t rc = node.writeSingleRegister(reg, val);
  return rc == node.ku8MBSuccess;
}
static bool parseNum(const String &s, uint16_t &out)
{
  char *end = nullptr;
  uint32_t v = (s.startsWith("0x") || s.startsWith("0X"))
                   ? strtoul(s.c_str(), &end, 16)
                   : strtoul(s.c_str(), &end, 10);
  if (end == s.c_str())
    return false;
  out = (uint16_t)v;
  return true;
}

// ---------- HTTP ----------
void sendJSON(const String &s) { server.send(200, "application/json", s); }

void handleIndex() { server.send_P(200, "text/html", INDEX_HTML); }

void handleStatus()
{
  uint16_t sV = 0, sA = 0, oV = 0, oA = 0, oP = 0, outE = 0, mppt = 0;
  bool ok = true;
  ok &= mbReadU16(REG_SET_VOLT, sV);
  ok &= mbReadU16(REG_SET_CURR, sA);
  ok &= mbReadU16(REG_OUT_VOLT, oV);
  ok &= mbReadU16(REG_OUT_CURR, oA);
  ok &= mbReadU16(REG_OUT_POWER, oP);
  bool mpptOk = mbReadU16(REG_MPPT_ENABLE, mppt); // experimental; may fail

  analogWrite(PIN_PWM_FUN, map(oP, MIN_POWER, MAX_POWER, 0, 255)); // Control fan speed based on power

  String json = "{";
  json += "\"ok\":";
  json += ok ? "true" : "false";
  json += ",";
  json += "\"setV\":";
  json += String(sV / 100.0f, 2);
  json += ",";
  json += "\"setA\":";
  json += String(sA / 1000.0f, 3);
  json += ",";
  json += "\"outV\":";
  json += String(oV / 100.0f, 2);
  json += ",";
  json += "\"outA\":";
  json += String(oA / 1000.0f, 3);
  json += ",";
  json += "\"outP\":";
  json += String(oP / 100.0f, 2);
  json += ",";
  if (mbReadU16(REG_OUT_ENABLE, outE))
  {
    json += "\"outputOn\":";
    json += (outE == 1 ? "true" : "false");
    json += ",";
  }
  else
  {
    json += "\"outputOn\":null,";
  }
  if (mpptOk)
  {
    json += "\"mppt\":";
    json += (mppt ? "true" : "false");
  }
  else
  {
    json += "\"mppt\":null";
  }
  json += "}";
  sendJSON(json);
}

void handleWrite()
{
  if (!server.hasArg("reg") || !server.hasArg("val"))
  {
    server.send(400, "application/json",
                "{\"ok\":false,\"msg\":\"reg & val required\"}");
    return;
  }
  uint16_t reg = (uint16_t)strtoul(server.arg("reg").c_str(), nullptr, 0);
  uint16_t val = (uint16_t)strtoul(server.arg("val").c_str(), nullptr, 0);
  bool ok = mbWriteU16(reg, val);
  server.send(ok ? 200 : 500, "application/json",
              String("{\"ok\":") +
                  (ok ? "true}" : "false,\"msg\":\"write failed\"}"));
}

String meaningFor(uint16_t addr)
{
  switch (addr)
  {
  case REG_SET_VOLT:
    return "Vset (V*100)";
  case REG_SET_CURR:
    return "Iset (A*1000)";
  case REG_OUT_VOLT:
    return "Vout (V*100)";
  case REG_OUT_CURR:
    return "Iout (A*1000)";
  case REG_OUT_POWER:
    return "Pout (W*100)";
  case REG_OUT_ENABLE:
    return "Output Enable (0/1)";
  case REG_MPPT_ENABLE:
    return "MPPT Enable (0/1) [exp]";
  default:
    return "";
  }
}

String interpretFor(uint16_t addr, uint16_t raw)
{
  switch (addr)
  {
  case REG_SET_VOLT:
  case REG_OUT_VOLT:
    return String(raw / 100.0f, 2) + " V";
  case REG_SET_CURR:
  case REG_OUT_CURR:
    return String(raw / 1000.0f, 3) + " A";
  case REG_OUT_POWER:
    return String(raw / 100.0f, 2) + " W";
  case REG_OUT_ENABLE:
    return raw ? "ON" : "OFF";
  case REG_MPPT_ENABLE:
    return raw ? "ON" : "OFF";
  default:
    return "";
  }
}

void handleScan()
{
  uint16_t start = 0x0000, end = 0x0080;
  if (server.hasArg("start"))
  {
    if (!parseNum(server.arg("start"), start))
    {
      server.send(400, "application/json",
                  "{\"ok\":false,\"msg\":\"bad start\"}");
      return;
    }
  }
  if (server.hasArg("end"))
  {
    if (!parseNum(server.arg("end"), end))
    {
      server.send(400, "application/json",
                  "{\"ok\":false,\"msg\":\"bad end\"}");
      return;
    }
  }
  if (end < start || (end - start) > 256)
  {
    server.send(400, "application/json",
                "{\"ok\":false,\"msg\":\"range too large\"}");
    return;
  }

  String json = "{\"ok\":true,\"rows\":[";
  bool first = true;
  for (uint16_t reg = start; reg <= end; reg++)
  {
    uint16_t v = 0;
    uint8_t rc = node.readHoldingRegisters(reg, 1);
    if (rc == node.ku8MBSuccess)
    {
      v = node.getResponseBuffer(0);
      node.clearResponseBuffer();
      if (!first)
        json += ",";
      first = false;
      String m = meaningFor(reg);
      String i = interpretFor(reg, v);
      json += "{\"addr\":" + String(reg) + ",\"dec\":" + String(v);
      if (m.length())
      {
        json += ",\"meaning\":\"" + m + "\"";
      }
      if (i.length())
      {
        json += ",\"interpretation\":\"" + i + "\"";
      }
      json += "}";
    }
    delay(5);
  }
  json += "]}";
  sendJSON(json);
}

