Stagnator/SK120X_ESP8266_Web_control/src/main.cpp
void notFound() { server.send(404, "text/plain", "Not found"); }

void connectWiFi()
{
  WiFi.hostname(ST_HOSTNAME);
  if (!DHCP_ENABLED)
  {
    bool b = WiFi.config(local_IP, gateway, subnet);
  }
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  Serial.print("Connecting to WiFi");
  unsigned long t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < 20000)
  {
    delay(500);
    Serial.print(".");
  }
  Serial.println();
  if (WiFi.status() == WL_CONNECTED)
  {
    Serial.print("WiFi OK, IP: ");
    Serial.println(WiFi.localIP());
  }
  else
  {
    Serial.print("WiFi failed; starting AP: ");
    Serial.println(AP_HOSTNAME);
    WiFi.softAP(AP_HOSTNAME);
    Serial.print("AP IP: ");
    Serial.println(WiFi.softAPIP());
  }
}

void setup()
{
  Serial.begin(115200);
  pinMode(15, OUTPUT); // esp8266 had some bag usinig serial swap without setting pin 15 to output?
  pinMode(PIN_PWM_FUN, OUTPUT);
  analogWrite(PIN_PWM_FUN, 128); // cooler init at half speed
  delay(100);
  connectWiFi();
  if (WiFi.getMode() != WIFI_AP) // Only setup OTA if not in AP mode
  {
    ArduinoOTA.setHostname(ST_HOSTNAME);
    ArduinoOTA.setPassword(OTA_PASSWORD);

    ArduinoOTA.onStart([]()
                       {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else {  // U_FS
      type = "filesystem";
    }

    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    Serial.swap(); Serial.println("Start updating " + type); Serial.flush(); Serial.swap(); });

    ArduinoOTA.onEnd([]()
                     { Serial.swap(); Serial.println("\nEnd"); Serial.flush(); Serial.swap(); });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                     { Serial.swap(); Serial.printf("Progress: %u%%\r", (progress / (total / 100))); Serial.flush(); Serial.swap(); });
    ArduinoOTA.onError([](ota_error_t error)
                     { Serial.swap();
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      Serial.println("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      Serial.println("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      Serial.println("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      Serial.println("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      Serial.println("End Failed");
    } Serial.flush();
  Serial.swap(); });

    ArduinoOTA.begin();
    Serial.println("OTA Ready");
  }

  server.on("/", HTTP_GET, handleIndex);
  server.on("/api/status", HTTP_GET, handleStatus);
  server.on("/api/write", HTTP_POST, handleWrite);
  server.on("/api/scan", HTTP_GET, handleScan);
  server.onNotFound(notFound);
  server.begin();
  Serial.println("HTTP server started.");

  // Serial2.begin(UART_BAUD, SERIAL_8N1, UART_RX, UART_TX); // Goin to use swap instead
  Serial.flush();
  Serial.swap();
#if USE_RS485_DIR
  pinMode(RS485_DE_RE_PIN, OUTPUT);
  digitalWrite(RS485_DE_RE_PIN, LOW);
#endif
  node.begin(MODBUS_SLAVE_ID, Serial);
  node.preTransmission(preTransmission);
  node.postTransmission(postTransmission);
}

void loop()
{
  server.handleClient();
  ArduinoOTA.handle();
}
